---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.WinderPathResult.Success
enum: Autodesk.Revit.DB.Architecture.WinderPathResult
source: html/4e13811c-ffa6-f862-c7b5-2d75f0797d3f.htm
---
# Autodesk.Revit.DB.Architecture.WinderPathResult.Success

Indicates curves are valid to use as path base lines for winder run.
 This is only one flag indicates curves are fine to use as winder path.